/* 
  iyan3d-en.strings
  Iyan3D

  Created by sabish on 21/07/16.
  Copyright © 2016 Smackall Games. All rights reserved.
*/

"Loading Assets" = "Loading Assets";
"Scenes" = "Scenes";

"Information" = "Information";
"Already_upgraded_Premium_Please_Restore_Purchase_Message" = "You have already upgraded to Premium. Please 'Signin' and use 'Restore Purchase' in 'Settings' menu to verify your purchase.";
"Alert" = "Alert";
"OK" = "OK";
"Ok" = "OK";
"No_Email_account_configured" = "No Email account is configured on this device.";
"My Scene %d" = "My Scene %d";

"Warning" = "Warning";
"Scene_name_empty" = "Scene name cannot be empty.";
"Scene_name_special_character" = "Scene name cannot contain any special characters.";

"Duplicate_Scene_Name" = "Duplicate Scene Name";
"Duplicate_Scene_Name_message" = "Another Scene with the same name already exists. Please provide a different name.";

"Rename Scene" = "Rename Scene";
"Please enter a new Scene name" = "Please enter a new Scene name";
"Cancel" = "Cancel";
"Scene Name" = "Scene Name";

"A Scene created using Iyan 3D in iOS." = "A Scene created using Iyan 3D in iOS.";

"Success" = "Success";
"file_successfully_saved_dropbox" = "File successfully saved to DropBox. You can find it in your DropBox account 'Apps/Iyan3D'.";

"Failure" = "Failure";
"Error_uploading_file" = "Error uploading file. Please check your internet connection.";
"unable_connect_server" = "Unable to connect to the server, Please check your network settings.";
"Connection Error" = "Connection Error";
"max_five_lights_per_scene" = "Scene cannot contain more than five lights.";
"File Corrupted" = "File Corrupted";
"File_Corrupted_message" = "The project you are trying to open is corrupted.";

"Select Bone Structure" = "Select Bone Structure";
"start_single_bone_or_human_message" = "You can either start with a complete Human Bone structure or with a single bone?";
"Single Bone" = "Single Bone";
"Human Bone Structure" = "Human Bone Structure";
"rigging_back_previous_mode" = "Are you sure you want to go back to previous mode? By pressing Yes all your changes will be discarded.";
"NO" = "NO";
"Yes" = "Yes";

"Light %d" = "Light %d";
"Delete" = "Delete";
"Clone" = "Clone";
"copy_limit_exceed_message" = "Copy limit exceeded. Import the object using 'Add' button on ToolBar.";

"CAMERA" = "CAMERA";
"LIGHT" = "LIGHT";
"Image : %@" = "Image : %@";
"Text : %@" = "Text : %@";
"Video : %@" = "Video : %@";

"apply_animation_error" = "Please select a text or character to apply the animation.";
"Save your Animation as template" = "Save your Animation as template";
"Animation Name" = "Animation Name";
"Bones cannot be added to this model." = "Bones cannot be added to this model.";
"model_cannot_add_bone" = "This model was rigged using the previous version. Some of the envelope information might be missing. Do you want to continue?";

"Please Select any Node to add Bone" = "Please Select any Node to add Bone";
"Delete Animation in this Frame" = "Delete Animation in this Frame";
"Delete Animation in this Frame" = "Delete Animation in this Frame";
"Delete Object" = "Delete Object";

"Info" = "Info";
"There is no animation in this frame." = "There is no animation in this frame.";
"Animation name cannot be empty." = "Animation name cannot be empty.";
"Animation_Name_special" = "Animation Name cannot contain any special characters.";

"Step_1_rigging_message" = "Place the bones in appropriate positions within the model.";
"Step_2_rigging_message" = "Scale each bone's envelope to cover the surrounding mesh.";
"Step_3_rigging_message" = "Make sure the rig is perfect by animating the model.";
"PREVIEW" = "PREVIEW";
"ADJUST ENVELOP" = "ADJUST ENVELOP";
"ATTACH SKELETON" = "ATTACH SKELETON";

"Cone" = "Cone";
"Cube" = "Cube";
"Cylinder" = "Cylinder";
"Plane" = "Plane";
"Sphere" = "Sphere";
"Torus" = "Torus";

"bone_count_exceed" = "The maximum bones per object cannot exceed 57.";



"Category" = "Category";
"All Models" = "All Models";
"Character" = "Character";
"Backgrounds" = "Backgrounds";
"Accessories" = "Accessories";
"Minecraft" = "Minecraft";
"FNAF" = "FNAF";
"My Library" = "My Library";

"Rename Object" = "Rename Object";
"Please enter a name" = "Please enter a name";
"Please Choose Font Style." = "Please Choose Font Style.";
"Please enter some text to add." = "Please enter some text to add.";


"Create a Scene" = "Create a Scene";
"Animate Character" = "Animate Character";
"Export Video" = "Export Video";
"Share your video" = "Share your video";

"onboarding_message_#1" = "Import 3d Mesh, Characters, Environment from any PC software. Most common file formats like Dae (Collada), FBX, OBJ & 3DS are supported";
"onboarding_message_#2" = "Bring your character to life apply physics simulation or make one of your own actions.";
"onboarding_message_#3" = "Render the final video with the desired quality and style.";
"onboarding_message_#4" = "That's it. Send your 3D movie and showoff your creative skills to your friends.";

"Next" = "Next";
"Let's get started" = "Let's get started";

"Models" = "Models";
"Images" = "Images";
"Videos" = "Videos";
"Text" = "Text";
"Light" = "Light";
"OBJ File" = "OBJ File";
"Add Bone" = "Add Bone";
"Particle Effects" = "Particle Effects";

"Apply Animation" = "Apply Animation";
"Save Animation" = "Save Animation";
"Images" = "Images";
"Videos" = "Videos";

"Tutorials" = "Tutorials";
"Settings" = "Settings";
"Rate This App" = "Rate This App";
"Follow Us" = "Follow Us";
"Contact Us" = "Contact Us";

"Front" = "Front";
"Top" = "Top";
"Left" = "Left";
"Back" = "Back";
"Right" = "Right";
"Bottom" = "Bottom";

"1 Frame" = "1 Frame";
"24 Frames" = "24 Frames";
"240 Frames" = "240 Frames";

"Camera" = "Camera";
"Light" = "Light";

"Clone" = "Clone";
"Delete" = "Delete";
"Rename" = "Rename";

"Move Camera" = "Move Camera";
"Publish" = "Publish";
"No data" = "No data";

"share_image_social_media" = "A 3D Scene, I created using Iyan 3D on iOS";
"share_video_social_media" = "An Animation video, I created using Iyan 3D on iOS";

"only_hq_options" = "This Property is only for HighQuality Rendering.";
"reopen_apply_changes" = "Please re-open the scene to apply the change.";
"sign_in_to_continue" = "Please SignIn to continue.";
"no_premium_restored" = "There seems to be a problem with your purchase. Please make sure that you have upgraded to Premium with the current account.";

"In Progress" = "In Progress";
"Completed" = "Completed";
"In Queue" = "In Queue";
"Download" = "Download";

"successful_saved_phot_gallery" = "Image/Video successfully saved to Photos.";
"failed_saved_phot_gallery" = "There is a problem downloading the image/video. Please try again later.";

"no_twitter_account" = "Setup Twitter Accounnt in your device.";
"APPLY" = "APPLY";

"select_obj_preview" = "Select an OBJ to preview.";
"choose_texture" = "Choose a texture to apply for the selected model.";
"choose_color" = "Choose vertex color for the selected OBJ.";
"tap_import_photos" = "Tap to import texture from Photo Library.";
"tap_to_choose_texture" = "Tap to choose texture / color for the selected object.";
"import_model_selected_texture" = "Import the model with the selected texture / color.";
"add_obj_document_dir" = "Add OBJ/DAE/FBX/3DS files in Document Directory.";
"add_texture_document_dir" = "Add Texture files in Document Directory.";
"Pick Color" = "Pick Color";
"ADD TO SCENE" = "ADD TO SCENE";

"Import Texture" = "Import Texture";

"Normal Shader" = "Normal Shader";
"Toon Shader" = "Toon Shader";
"HQ Rendering" = "HQ Rendering";

"tap_to_start" = "Tap to start exporting.";
"please_signin" = "Please SignIn to continue.";

"not_enough_credits" = "You are not have enough credits please recharge your account to proceed.";
"scene_no_support_hqrender" = "Scene contains video/praticles which is currently not supported in HQ rendering.";
"data_doesnot_exist" = "The Requested Data doest not exist!!";
"hqrender_uploaded_success" = "Uploaded successfully. You can see the progress of your render in your profile view.";
"Done" = "Done";


"Rename Animation" = "Rename Animation";

"Trending" = "Trending";
"Featured" = "Featured";
"Top Rated" = "Top Rated";
"Recent" = "Recent";
"My Animations" = "My Animations";

"username_has_special_char" = "User Name cannot contain any special characters.";
"username_isempty" = "User name cannot be empty.";

"Success" = "Success";
"success_animation_publish" = "Animation Published Successfully.";
"bone_count_mismatch" = "Bone count cannot match.";
"fontstyle_char_unsupported" = "The font style you choose does not support the characters you entered.";

"inapp_disabled" = "In-App Purchase is Disabled. Check your settings to enable Purchases.";
"missing_resources" = "Some resources files are missing.";

"My Objects" = "My Objects";
"Edit" = "Edit";

"ADD" = "  ADD";
"ANIMATION" = "  ANIMATION";
"OPTIONS" = "  OPTIONS";
"EXPORT" = "  EXPORT";

"MOVE" = "  MOVE";
"ROTATE" = "  ROTATE";
"SCALE" = "  SCALE";

"ADD JOINT" = "  ADD JOINT";
"MIRROR" = "MIRROR";
"CANCEL" = "CANCEL";
"ADD TO SCENE" = "ADD TO SCENE";

"Enter Text" = "Enter Text";
"With Bones" = "With Bones";
"Color" = "Color";
"Font Store" = "Font Store";
"My Fonts" = "My Fonts";
"News Feed" = "News Feed";
"Clear All" = "Clear All";
"SHARE" = "SHARE";
"CLOSE" = "CLOSE";

"FRAME COUNT DISPLAY" = "FRAME COUNT DISPLAY";
"TOOLBAR" = "TOOLBAR";
"3D WORKSPACE" = "3D WORKSPACE";
"Quality" = "Quality";
"Speed" = "Speed";
"This setting does not affect Export quality" = "This setting does not affect Export quality";
"MultiSelect" = "MultiSelect";

"RESTORE PURCHASE" = "RESTORE PURCHASE";
"SETTINGS" = "SETTINGS";

"Credits" = "Credits";
"Add 5k Credits" = "Add 5k Credits";
"Add 20k Credits" = "Add 20k Credits";
"Add 50k Credits" = "Add 50k Credits";
"HQ Render Progress" = "HQ Render Progress";
"Manage Account" = "Manage Account";
"Sign Out" = "Sign Out";
"Add Credits" = "Add Credits";

"Sign In" = "Sign In";
"Login to enjoy more features" = "Login to enjoy more features";

"Copy OBJ files in Document Directory." = "Copy OBJ files in Document Directory.";
"Import Obj" = "Import Obj";
"NEXT" = "NEXT";

"Create Scene" = "Create Scene";
"Creates a new scene." = "Creates a new scene.";
"Tap to open the scene." = "Tap to open the scene.";
"Tap to Clone / Delete / Share the scene." = "Tap to Clone / Delete / Share the scene.";


"RENDERING PROGRESS" = "RENDERING PROGRESS";
"RESOLUTION" = "RESOLUTION";
"BACKGROUND COLOR" = "BACKGROUND COLOR";
"WATERMARK" = "WATERMARK";
"RENDERING STYLE" = "RENDERING STYLE";
"Render Normal Shader in Your Device" = "Render Normal Shader in Your Device";
"LIMIT FRAMES" = "LIMIT FRAMES";

"ADD" = "ADD";

"Manage your account" = "Manage your account";
"Settings, Tutorials & Contact us" = "Settings, Tutorials & Contact us";


"Save and Exit the scene" = "Save and Exit the scene";
"Add Frames" = "Add Frames";
"Standard view angles" = "Standard view angles";
"Play the animation preview" = "Play the animation preview";
"Switch to Move / Rotate / Scale mode" = "Switch to Move / Rotate / Scale mode";
"Enable mirror to move / rotate the mirror joint of the selected joint" = "Enable mirror to move / rotate the mirror joint of the selected joint";
"Import objects into the scene" = "Import objects into the scene";
"Apply animation to the selected model/text" = "Apply animation to the selected model/text";
"Change properties of selected object" = "Change properties of selected object";
"Export image/video to the Camera roll" = "Export image/video to the Camera roll";
"Undo / Redo your actions" = "Undo / Redo your actions";
"Tap to add the rigged model in to the scene" = "Tap to add the rigged model in to the scene";
"Tap to publish your animation to the store" = "Tap to publish your animation to the store";
"Current mode in rigging" = "Current mode in rigging";
"Tap to add a joint to the selected joint in the rig" = "Tap to add a joint to the selected joint in the rig";
"Manage objects in the scene" = "Manage objects in the scene";
"Switch to Move / Rotate / Scale mode" = "Switch to Move / Rotate / Scale mode";
"Enable to move / rotate the mirror joint of selected joint" = "Enable to move / rotate the mirror joint of selected joint";
"Cancel rigging and go back to the scene" = "Cancel rigging and go back to the scene";
"Tap to change model category" = "Tap to change model category";
"Tap to import the selected model into your scene." = "Tap to import the selected model into your scene.";
"Import selected 3D text into the scene." = "Import selected 3D text into the scene.";
"Choose color for 3D text." = "Choose color for 3D text.";
"Add bevel to 3D text." = "Add bevel to 3D text.";
"Enter your text here." = "Enter your text here.";

"Tap to save and close the Settings." = "Tap to save and close the Settings.";
"Enable or Disable multiple objects selection." = "Enable or Disable multiple objects selection.";
"Choose whether toolbar should be on the right or left side in Editor." = "Choose whether toolbar should be on the right or left side in Editor.";
"Choose between quality or speed of rendering in Editor." = "Choose between quality or speed of rendering in Editor.";

"Enable/Disable Watermark image." = "Enable/Disable Watermark image.";
"Limit the number of frames to be exported." = "Limit the number of frames to be exported.";
"Credits required for the current export." = "Credits required for the current export.";
"Tap to change category." = "Tap to change category.";
"Tap to apply animation to the selected object." = "Tap to apply animation to the selected object.";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";
"" = "";



























